jmeter.log
2019-07-30 16:29:46,354 INFO o.a.j.u.JMeterUtils: Setting Locale to zh_CN
2019-07-30 16:29:46,375 INFO o.a.j.JMeter: Loading user properties from: H:\jmeter\apache-jmeter-5.1.1\bin\user.properties
2019-07-30 16:29:46,375 INFO o.a.j.JMeter: Loading system properties from: H:\jmeter\apache-jmeter-5.1.1\bin\system.properties
2019-07-30 16:29:46,379 INFO o.a.j.JMeter: Copyright (c) 1998-2019 The Apache Software Foundation
2019-07-30 16:29:46,379 INFO o.a.j.JMeter: Version 5.1.1 r1855137
2019-07-30 16:29:46,379 INFO o.a.j.JMeter: java.version=1.8.0_121
2019-07-30 16:29:46,379 INFO o.a.j.JMeter: java.vm.name=Java HotSpot(TM) 64-Bit Server VM
2019-07-30 16:29:46,379 INFO o.a.j.JMeter: os.name=Windows 10
2019-07-30 16:29:46,379 INFO o.a.j.JMeter: os.arch=amd64
2019-07-30 16:29:46,380 INFO o.a.j.JMeter: os.version=10.0
2019-07-30 16:29:46,380 INFO o.a.j.JMeter: file.encoding=GBK
2019-07-30 16:29:46,380 INFO o.a.j.JMeter: java.awt.headless=true
2019-07-30 16:29:46,380 INFO o.a.j.JMeter: Max memory     =2147483648
2019-07-30 16:29:46,380 INFO o.a.j.JMeter: Available Processors =8
2019-07-30 16:29:46,382 INFO o.a.j.JMeter: Default Locale=English (EN)
2019-07-30 16:29:46,383 INFO o.a.j.JMeter: JMeter  Locale=Chinese (China)
2019-07-30 16:29:46,383 INFO o.a.j.JMeter: JMeterHome=H:\jmeter\apache-jmeter-5.1.1
2019-07-30 16:29:46,383 INFO o.a.j.JMeter: user.dir  =H:\jmeter\workplace
2019-07-30 16:29:46,383 INFO o.a.j.JMeter: PWD       =H:\jmeter\workplace
2019-07-30 16:29:50,891 INFO o.a.j.JMeter: IP: 192.168.191.1 Name: LAPTOP-QO3IU1VG FullName: LAPTOP-QO3IU1VG
2019-07-30 16:29:50,893 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'E:\201907301629'
2019-07-30 16:29:50,895 INFO o.a.j.s.FileServer: Default base='H:\jmeter\workplace'
2019-07-30 16:29:50,899 INFO o.a.j.s.FileServer: Set new base='H:\jmeter\workplace\.'
2019-07-30 16:29:50,999 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2019-07-30 16:29:51,013 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2019-07-30 16:29:51,018 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2019-07-30 16:29:51,022 INFO o.a.j.s.SaveService: Loading file: .\自定义sample.jmx
2019-07-30 16:29:51,115 INFO o.a.j.JMeter: Creating summariser <summary>
2019-07-30 16:29:51,119 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2019-07-30 16:29:51,120 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: E\201907301629.jtl
2019-07-30 16:29:51,120 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: H:\jmeter\apache-jmeter-5.1.1\bin\reportgenerator.properties
2019-07-30 16:29:51,120 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2019-07-30 16:29:51,124 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2019-07-30 16:29:51,126 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2019-07-30 16:29:51,126 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction : {} is empty, not APDEX per transaction customization
2019-07-30 16:29:51,127 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2019-07-30 16:29:51,127 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2019-07-30 16:29:51,127 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2019-07-30 16:29:51,127 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2019-07-30 16:29:51,127 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2019-07-30 16:29:51,127 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2019-07-30 16:29:51,130 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2019-07-30 16:29:51,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-07-30 16:29:51,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2019-07-30 16:29:51,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2019-07-30 16:29:51,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2019-07-30 16:29:51,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2019-07-30 16:29:51,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-07-30 16:29:51,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-07-30 16:29:51,131 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-07-30 16:29:51,132 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2019-07-30 16:29:51,132 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2019-07-30 16:29:51,132 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2019-07-30 16:29:51,132 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2019-07-30 16:29:51,133 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2019-07-30 16:29:51,133 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2019-07-30 16:29:51,133 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2019-07-30 16:29:51,141 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2019-07-30 16:29:51,141 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2019-07-30 16:29:51,141 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2019-07-30 16:29:51,148 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2019-07-30 16:29:51,148 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2019-07-30 16:29:51,431 INFO o.a.j.JMeter: 正在运行的测试 (1564475391431)
2019-07-30 16:29:51,458 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : 线程组
2019-07-30 16:29:51,459 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group 线程组.
2019-07-30 16:29:51,459 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2019-07-30 16:29:51,459 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2019-07-30 16:29:51,465 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2019-07-30 16:29:51,465 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2019-07-30 16:29:51,466 INFO o.a.j.t.JMeterThread: Thread started: 线程组 1-1
2019-07-30 16:29:51,468 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2019-07-30 16:29:51,468 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to utf-8
2019-07-30 16:29:51,468 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2019-07-30 16:29:51,468 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2019-07-30 16:29:51,542 INFO o.a.j.t.JMeterThread: Thread is done: 线程组 1-1
2019-07-30 16:29:51,542 INFO o.a.j.t.JMeterThread: Thread finished: 线程组 1-1
2019-07-30 16:29:51,542 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2019-07-30 16:29:51,543 INFO o.a.j.r.Summariser: summary =      1 in 00:00:00 =    8.9/s Avg:    71 Min:    71 Max:    71 Err:     0 (0.00%)
2019-07-30 16:29:51,544 INFO o.a.j.JMeter: Generating Dashboard
2019-07-30 16:29:51,544 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2019-07-30 16:29:51,552 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2019-07-30 16:29:51,830 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2019-07-30 16:29:51,830 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2019-07-30 16:29:51,832 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2019-07-30 16:29:51,833 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2019-07-30 16:29:51,840 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2019-07-30 16:29:51,845 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2019-07-30 16:29:51,845 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2019-07-30 16:29:51,845 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2019-07-30 16:29:51,858 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2019-07-30 16:29:51,858 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2019-07-30 16:29:51,859 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2019-07-30 16:29:51,859 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2019-07-30 16:29:51,862 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2019-07-30 16:29:51,862 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 14 samples
2019-07-30 16:29:51,862 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2019-07-30 16:29:51,863 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2019-07-30 16:29:51,863 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2019-07-30 16:29:51,863 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2019-07-30 16:29:51,863 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2019-07-30 16:29:51,863 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2019-07-30 16:29:51,864 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2019-07-30 16:29:51,864 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2019-07-30 16:29:51,864 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2019-07-30 16:29:51,864 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2019-07-30 16:29:51,864 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 30 samples
2019-07-30 16:29:51,864 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 6 samples
2019-07-30 16:29:51,864 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 2 samples
2019-07-30 16:29:51,865 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 2 samples produced in 290ms on channel 0
2019-07-30 16:29:51,865 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2019-07-30 16:29:51,866 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary?in context
2019-07-30 16:29:51,866 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2019-07-30 16:29:51,867 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2019-07-30 16:29:51,867 INFO o.a.j.r.d.JsonExporter: Checking output folder
2019-07-30 16:29:51,868 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to E:\201907301629\statistics.json
2019-07-30 16:29:52,019 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2019-07-30 16:29:52,021 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: E:\201907301629
2019-07-30 16:29:52,092 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: E:\201907301629, creating folder structure
2019-07-30 16:29:52,094 INFO o.a.j.r.d.TemplateVisitor: Copying folder from 'H:\jmeter\apache-jmeter-5.1.1\bin\report-template' to 'E:\201907301629', got message:[E:\201907301629\statistics.json], found non empty folder with following content {}, will be ignored
2019-07-30 16:29:52,454 INFO o.a.j.JMeter: Dashboard generated